package javaIntro_6_Task_3;

public class Practice03_Main_ClientServer_Archive {

	public static void main(String[] args) {

		/* Задание 3: создайте клиент-серверное приложение "Архив".
		 * 
		 * Общие требования к заданию:
		 * 	- В архиве хранятся Дела (например, студентов). Архив находится на сервере.
		 *  - Клиент в зависимости от прав, может запросить дело на просмотр, внести в 
		 *    него изменения, или создать новое дело.
		 * 
		 * Требования к коду лабораторной работы:
		 *  - Для реализайии сетевого соединения используйте сокеты.
		 *  - Формат хранения данных на сервере - xml-файлы.
		 */
		
		//1. Run server
		//2. Run client	

	}

}
